{
  "version": "2.0",
  "defaults": {
    "client_name": "Alyssa",
    "client_email": "alyssa.magnetmomentsco@gmail.com",
    "project_name": "Magnet Moments Co. — Custom Website",
    "project_description": "Custom-designed website for Magnet Moments Co. including: 22+ page static site (Home, Shop, 8 product detail pages, Events, Wholesale, About, Contact, FAQ, 4 policy pages, 404), Shopify Storefront API cart integration, automated product sync every 6 hours, SEO with JSON-LD structured data, and a full Admin Dashboard ('Command Center') with Firebase analytics.",
    "total_amount": 3500,
    "deposit_amount": 500,
    "payment_method": "zelle",
    "payment_terms": "Non-refundable deposit of $500.00 due to initiate the project (already received). Remaining balance of $3,000.00 to be paid in monthly installments of $100.00 – $200.00, depending on Client's monthly sales volume, until the balance is cleared."
  },
  "clauses": [
    {
      "id": "scope-of-work",
      "title": "Scope of Work (The \"Engineering-Grade\" Build)",
      "body": "Provider agrees to design and deploy a custom website for Client. Specific features include:\n\n• Full Custom Website: 22+ pages — Home, Shop, 8 individual product detail pages (auto-generated), Events booking, Wholesale inquiry, About, Contact, FAQ, 4 policy pages, and 404 page — all designed to match the brand's warm, handcrafted personality.\n\n• Automated Shopify Hooks: Custom backend logic that automatically syncs the GitHub website with the Shopify Admin dashboard every 6 hours, with real-time client-side overlay for instant price/inventory updates.\n\n• SEO & Performance: Implementation of sitemap.xml, custom meta tags for every product, JSON-LD structured data (Organization, LocalBusiness, Product, FAQPage schemas), and 90+ PageSpeed scores.\n\n• Deployment: Hosting setup on GitHub Pages with the custom domain magnetmomentsco.us.\n\n• Admin Dashboard (\"Command Center\"): A comprehensive analytics dashboard at /admin/ powered by Firebase Realtime Database with Google sign-in authentication. See 'Admin Dashboard Features' clause for full feature breakdown.",
      "category": "core",
      "enabled": true
    },
    {
      "id": "admin-dashboard",
      "title": "Admin Dashboard Features (\"Command Center\")",
      "body": "The Admin Dashboard replaces ~$307/month in third-party analytics tools (Hotjar, Optimizely, Lucky Orange, Crazy Egg, Sentry, UptimeRobot, SEO audit tools, social proof widgets) — all at $0/month via Firebase's free tier. Dashboard includes 19 panels:\n\n1. Live Visitors — real-time count of people on-site and which pages they're on\n2. Scroll Depth — how far visitors scroll on each page (25%, 50%, 75%, 100%)\n3. Click Heatmap — every click tracked with coordinates, targets, and rage click detection\n4. Product Funnel — Hover → Modal → Image Browse → Add to Cart → Checkout\n5. Session Recordings — scroll + click timeline per visitor session\n6. A/B Testing — experiment variants, visitor bucketing, statistical significance\n7. Newsletter Popup — popup shown/dismissed/submitted, conversion rates\n8. Visitor Intent Scoring — points-based system (Low/Medium/High intent)\n9. Traffic Sources — referrer breakdown, UTM campaigns, social vs organic vs paid\n10. Device & Performance — Core Web Vitals (LCP, FID, CLS, INP), load times by device\n11. Revenue Estimator — traffic × conversion rate × AOV = projected revenue\n12. Cart Analytics — items added together, time to cart, abandoned products\n13. SEO Audit — missing meta tags, alt text, schema validation, broken links\n14. Error Monitoring — JS errors, 404 hits, image failures, API errors\n15. Social Proof — '🔥 X people viewed this today' badges powered by real data\n16. Weekly Digest — auto-generated summary report\n17. GitHub Deploy Status — latest deployment status from GitHub Actions API\n18. Quick Actions — one-click buttons: trigger sync, view live site, run tests\n19. Shopify Products — live product data from Shopify, inventory status\n\nArchitecture: Firebase Realtime Database (free tier: 1GB storage, 10GB/mo bandwidth), Firebase Auth (Google sign-in, email whitelist), Chart.js v4 for visualizations, 855-line tracking script (mm-tracker.js) on every page.",
      "category": "technical",
      "enabled": true
    },
    {
      "id": "payment-terms",
      "title": "Payment Terms (The Flexible Plan)",
      "body": "• Deposit: A non-refundable down payment of $500.00 is due today to initiate the project.\n\n• Balance: The remaining balance will be paid in monthly installments of $100.00 – $200.00, depending on the Client's monthly sales volume, until the balance is cleared.\n\n• Transfer: The live site will be transferred to the Client's custom domain upon receipt of the deposit, but full ownership of files is subject to the Intellectual Property & Ownership clause.",
      "category": "core",
      "enabled": true
    },
    {
      "id": "ownership",
      "title": "Intellectual Property & Ownership (The Key Fix)",
      "body": "This section distinguishes between the Client's Website and the Provider's Code:\n\n• The Website: Upon final payment, the Client receives full ownership of the final website files, content, and branding elements.\n\n• The Software/Code: The custom automation 'hooks,' scripts, and underlying logic (including but not limited to sync-products.py, mm-tracker.js, shopify-cart.js, and the Admin Dashboard codebase) remain the exclusive property of AjayaDesign. The Client is granted a perpetual, non-transferable license to use this code for the operation of their website.\n\n• Portfolio Rights: Provider retains the right to showcase the completed project and its performance metrics in the AjayaDesign portfolio.",
      "category": "legal",
      "enabled": true
    },
    {
      "id": "hosting-domain",
      "title": "Hosting & Domain",
      "body": "The website will be hosted on GitHub Pages at $0/month. The Client is responsible for the annual costs of the domain name (magnetmomentsco.us) and their Shopify subscription. Provider will assist with the DNS configuration at no extra charge. Current setup: A records pointing to GitHub's IPs (185.199.108-111.153), CNAME for www → magnetmomentsco.github.io, automatic HTTPS via Let's Encrypt.",
      "category": "technical",
      "enabled": true
    },
    {
      "id": "warranty",
      "title": "Warranty & Support",
      "body": "Provider warrants the website will function as described for 30 days after delivery. During this period, any bugs or issues related to the original scope will be fixed at no cost. Post-warranty maintenance is available at a separate rate.",
      "category": "support",
      "enabled": true
    },
    {
      "id": "liability",
      "title": "Limitation of Liability",
      "body": "Provider's total liability shall not exceed the total contract amount. Provider is not liable for indirect damages, including lost profits from third-party service outages (GitHub, Shopify, Firebase, Google). Client is responsible for maintaining backups of their content and Shopify product data.",
      "category": "legal",
      "enabled": true
    },
    {
      "id": "auto-sync",
      "title": "Automatic Product Sync",
      "body": "The website includes a 3-layer automatic product sync system:\n\n1. GitHub Actions Build: Fetches all products from Shopify's API every 6 hours, generates static HTML product cards and SEO-friendly JSON-LD structured data.\n\n2. Static Data Snapshot: Saves products.json with all product data (names, prices, images, inventory, variant IDs) as a reliable data source.\n\n3. Client-Side Live Overlay: JavaScript checks Shopify's API in real time on every page load (~200ms) to patch price changes, sold-out status, or new products between builds.\n\nClient manages products in Shopify Admin as before. Changes (new products, price changes, inventory updates, sold-out status) are reflected automatically.",
      "category": "technical",
      "enabled": true
    },
    {
      "id": "responsive-design",
      "title": "Responsive Design & Accessibility",
      "body": "The website is fully responsive across desktop, tablet, and mobile devices. Tested with 205 automated tests across 3 viewports (1280x800, 375x812, 320x568) using Playwright + axe-core. Meets WCAG 2.1 AA accessibility standards including: skip-to-content links, proper ARIA roles, keyboard navigation, focus management, and touch targets >= 44x44px on mobile.",
      "category": "technical",
      "enabled": true
    },
    {
      "id": "seo",
      "title": "SEO & Search Optimization",
      "body": "Provider implements comprehensive SEO including: custom meta tags per page, JSON-LD structured data (Product, Organization, LocalBusiness, FAQPage schemas), Open Graph / Twitter Card meta for social sharing, individual product URLs for Google indexing, gift-related keywords (gifts for him/her/family), nationwide shipping language, B2B keywords (promotional magnets, corporate gifts, trade show giveaways), and breadcrumb navigation for Google rich results.",
      "category": "technical",
      "enabled": true
    },
    {
      "id": "confidentiality",
      "title": "Confidentiality",
      "body": "Both parties agree to keep confidential any proprietary information shared during this project, including but not limited to business plans, client data, Shopify API tokens, Firebase credentials, login credentials, and trade secrets. This obligation survives the termination of this contract.",
      "category": "legal",
      "enabled": true
    },
    {
      "id": "termination",
      "title": "Termination",
      "body": "Either party may terminate this contract with 7 days written notice. If Client terminates, the deposit is non-refundable and Client pays for all work completed to date. If Provider terminates, Provider will refund any prepaid amounts for undelivered work and provide all completed files.",
      "category": "legal",
      "enabled": true
    },
    {
      "id": "revisions",
      "title": "Revisions",
      "body": "The project includes up to 3 rounds of revisions after the initial delivery. Each revision round allows Client to request reasonable changes to layout, content, colors, and imagery. Additional revision rounds beyond the included 3 will be billed at $50/hour.",
      "category": "core",
      "enabled": true
    },
    {
      "id": "force-majeure",
      "title": "Force Majeure",
      "body": "Neither party shall be liable for delays or failure to perform due to circumstances beyond their reasonable control, including but not limited to natural disasters, pandemics, internet outages, or government actions. Affected timelines will be adjusted accordingly.",
      "category": "legal",
      "enabled": false
    },
    {
      "id": "maintenance",
      "title": "Ongoing Maintenance",
      "body": "This contract does not include ongoing website maintenance, content updates, or hosting management beyond the initial delivery and 30-day warranty. These services can be arranged under a separate monthly maintenance agreement.",
      "category": "support",
      "enabled": false
    }
  ]
}
